Super duper config

Put =(org-babel-load-file (expand-file-name "~/dotfiles/config/emacs/init.org"))= to =~/.emacs.d/init.el=

** Orgmode directory
#+begin_src emacs-lisp
      (custom-set-variables
        '(org-directory "~/Sync/orgmode")
        '(org-agenda-files '("~/Sync/orgmode/gtd/inbox.org"
                             "~/Sync/orgmode/gtd/next.org"
                             "~/Sync/orgmode/gtd/tickler.org"
                             "~/Sync/orgmode/gtd/projects/")))

  (setq org-agenda-files '("~/Sync/orgmode/gtd/inbox.org"
                           "~/Sync/orgmode/gtd/next.org"
                           "~/Sync/orgmode/gtd/tickler.org"
                           "~/Sync/orgmode/gtd/projects/"))

  (setq org-refile-targets '(("~/Sync/orgmode/gtd/next.org" :maxlevel . 3)
                             ("~/Sync/orgmode/gtd/someday.org" :level . 1)
                             ("~/Sync/orgmode/gtd/inbox.org" :level . 1)
                             ("~/Sync/orgmode/gtd/archive.org" :level . 1)
                             ("~/Sync/orgmode/gtd/tickler.org" :maxlevel . 2)
                             ("~/Sync/orgmode/gtd/projects/" :maxlevel . 2)))

  (setq org-capture-templates '(("t" "Todo [inbox]" entry
                                 (file+headline "~/Sync/orgmode/gtd/inbox.org" "Inbox")
                                 "* %i%?\n")
                                ("T" "Tickler" entry
                                 (file+headline "~/Sync/orgmode/gtd/tickler.org" "Tickler")
                                 "* %i%? \n %U")))

  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)
  (setq org-todo-keywords
        '((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELED(c)")))
  #+end_src

  #+RESULTS:
  | sequence | TODO(t) | IN-PROGRESS(i) | WAITING(w) |   |   | DONE(d) | CANCELED(c) |
 
** Elm mode
#+begin_src emacs-lisp
  (use-package elm-mode
    :ensure t)
  (add-hook 'elm-mode-hook 'elm-format-on-save-mode)
#+end_src

#+RESULTS:
| elm-format-on-save-mode | elm-indent-mode |

